In [1]:
import pandas as pd

In [2]:
#creating a simple dataframe
weather={
    'day':['monday','tuesday','wednesday','thursday','friday','saturday'],
    'temp':[32,45,36,28,33,42],
    'winds':[3,4,5,6,7,8],
    'event':['rain','sunny','sunny','snowy','rain','sunny']
}
df= pd.DataFrame(weather)
df

         day  temp  winds  event
0     monday    32      3   rain
1    tuesday    45      4  sunny
2  wednesday    36      5  sunny
3   thursday    28      6  snowy
4     friday    33      7   rain
5   saturday    42      8  sunny

In [3]:
#now to get the dimension of this datframe 
df.shape

(6, 4)

In [4]:
#to get some initial rows incase you have  a big datframe
df.head()

         day  temp  winds  event
0     monday    32      3   rain
1    tuesday    45      4  sunny
2  wednesday    36      5  sunny
3   thursday    28      6  snowy
4     friday    33      7   rain

In [5]:
#to get rows from last
df.tail()

         day  temp  winds  event
1    tuesday    45      4  sunny
2  wednesday    36      5  sunny
3   thursday    28      6  snowy
4     friday    33      7   rain
5   saturday    42      8  sunny

In [6]:
#indexing n slicing
#to get specific no of rows
df[2:5]

         day  temp  winds  event
2  wednesday    36      5  sunny
3   thursday    28      6  snowy
4     friday    33      7   rain

In [7]:
#to get columns
df.columns

Index(['day', 'temp', 'winds', 'event'], dtype='object')

In [8]:
#to get the content of column
df['event'] #df.event

0     rain
1    sunny
2    sunny
3    snowy
4     rain
5    sunny
Name: event, dtype: object

In [9]:
#to get two columns
df[['event','day']]

   event        day
0   rain     monday
1  sunny    tuesday
2  sunny  wednesday
3  snowy   thursday
4   rain     friday
5  sunny   saturday

In [10]:
#to get rows
df.loc[2]

day      wednesday
temp            36
winds            5
event        sunny
Name: 2, dtype: object

In [11]:
#to update a row
df.loc[2]=["wed",34,6,"snowy"]
df

        day  temp  winds  event
0    monday    32      3   rain
1   tuesday    45      4  sunny
2       wed    34      6  snowy
3  thursday    28      6  snowy
4    friday    33      7   rain
5  saturday    42      8  sunny

In [12]:
#to update a specific value
df.loc[2,"event"]="rainy"
df

        day  temp  winds  event
0    monday    32      3   rain
1   tuesday    45      4  sunny
2       wed    34      6  rainy
3  thursday    28      6  snowy
4    friday    33      7   rain
5  saturday    42      8  sunny

In [13]:
#we can rename columns name
df.rename(columns={"day":"DAY","temp":"TEMP","winds":"WIND","event":"EVENTS"},inplace=True)
df

        DAY  TEMP  WIND EVENTS
0    monday    32     3   rain
1   tuesday    45     4  sunny
2       wed    34     6  rainy
3  thursday    28     6  snowy
4    friday    33     7   rain
5  saturday    42     8  sunny

In [14]:
#APPLY FUNCTION
df["EVENTS"].apply(len)

0    4
1    5
2    5
3    5
4    4
5    5
Name: EVENTS, dtype: int64

In [15]:
#CAN CREATE A LIL FUNCTION USING APPLY
def update_event(EVENTS):
    return EVENTS.upper()
df["EVENTS"].apply(update_event)

0     RAIN
1    SUNNY
2    RAINY
3    SNOWY
4     RAIN
5    SUNNY
Name: EVENTS, dtype: object

In [16]:
#some operations like max(),mean(),
df['TEMP'].max()

45

In [17]:
df['TEMP'].mean()

35.666666666666664

In [18]:
df['WIND'].std()

1.8618986725025255

In [19]:
#to get whole statistics of your data 
df.describe()

            TEMP      WIND
count   6.000000  6.000000
mean   35.666667  5.666667
std     6.470446  1.861899
min    28.000000  3.000000
25%    32.250000  4.500000
50%    33.500000  6.000000
75%    40.000000  6.750000
max    45.000000  8.000000

In [20]:
#conditional select the data in dataframe
#like give rows where my temp is greater than 32
df[df.TEMP>=40]

        DAY  TEMP  WIND EVENTS
1   tuesday    45     4  sunny
5  saturday    42     8  sunny

In [24]:
df.set_index('DAY',inplace=True)

In [25]:
df

          TEMP  WIND
DAY
monday      32     3
tuesday     45     4
wed         34     6
thursday    28     6
friday      33     7
saturday    42     8

In [26]:
#to get unique values
df.nunique()

TEMP    6
WIND    5
dtype: int64

In [27]:
#to check if datframe is null
df.isnull()

           TEMP   WIND
DAY
monday    False  False
tuesday   False  False
wed       False  False
thursday  False  False
friday    False  False
saturday  False  False

In [ ]:
df

In [28]:
df1=pd.DataFrame({
    "city":["new york","chicago","orlando"],
    "temp":[21,34,28],
})
df1

       city  temp
0  new york    21
1   chicago    34
2   orlando    28

In [29]:
df2=pd.DataFrame({
    "city":["new york","chicago","orlando"],
    "humdity":[65,56,65],
})
df2

       city  humdity
0  new york       65
1   chicago       56
2   orlando       65

In [30]:
#IF WE WANNA MERGE THESE TWO DATAFRAMES 
df3=pd.merge(df1,df2,on="city")
df3

       city  temp  humdity
0  new york    21       65
1   chicago    34       56
2   orlando    28       65

In [31]:
df4=pd.DataFrame({
    "city":["new york","chicago","francisco"],
    "humidity":[21,34,56],
})
df4

        city  humidity
0   new york        21
1    chicago        34
2  francisco        56

In [32]:
#merging outer
df3=pd.merge(df2,df4,on="city",how="outer")
df3

        city  humdity  humidity
0   new york     65.0      21.0
1    chicago     56.0      34.0
2    orlando     65.0       NaN
3  francisco      NaN      56.0